app/Http/Controllers/Endpoints/SearchSiteController.php

    public function all(Request $request)
    {
        $search = $request->input('search');

        if (Str::startsWith($search, '%')) {
            $search = '';
        }

        $users = User::where('username', 'LIKE', "%{$search}%")->get();
        $items = Item::where('name', 'LIKE', "%{$search}%")->get();
---
select * from `users` where `username` LIKE '%john%'
select * from `items` where `name` LIKE '%john%'