app/Http/Controllers/Endpoints/ThumbnailController.php

    public function getThumbnail($type, $id)
    {
        // Determine the logic to fetch the final image URL based on $type and $id
        if ($type == 1) {
            // Fetch the final image URL for an item
            $item = Item::where('id', '=', $id)->firstOrFail();
            $imageUrl = $item->thumbnail();
        } elseif ($type == 2) {
            // Fetch the final image URL for a user
            $user = User::where('id', '=', $id)->firstOrFail();
---
select * from `users` where `id` = '1' limit 1