app/Http/Controllers/GrabController.php

    public function WelcomeIndex()
    {
        $uc = User::count();
---
select count(*) as aggregate from `users`

    public function DashboardVal(Request $request)
    {
        $this->validate($request, [
            'message' => ['max:124']
        ]);

        if ($request->message != Auth::user()->latestStatus()) {
            // Logging
            $status = new Status;
            $status->creator_id = Auth::user()->id;
            $status->message = $request->message;
            $status->save();
            $user = User::where('id', '=', Auth::user()->id)->first();
            $user->status = $request->message;
            $user->save();
---
select * from `users` where `id` = 1 limit 1
update `users` set `status` = 'r4r4', `users`.`updated_at` = '2023-09-05 02:27:55' where `id` = 1

    public function UserIndex()
    {
        $users = User::orderBy('updated_at', 'desc')->paginate(10)->through(function ($user) {
            return [
                'id' => $user->id,
                'username' => $user->username,
                'dname' => $user->display_name,
                'staff' => $user->staff,
                'status' => $user->status,
                'DateHum' => $user->DateHum,
		'avatar' => $user->headshot(),
                'online' => $user->online(),

            ];
        });
---
select * from `users` order by `updated_at` desc limit 10 offset 0
select count(*) as aggregate from `users`

    public function ProfileIndex($username)
    {
        $user = User::where('username', '=', $username);

        if (!$user->exists()) {
            $usernameHistory = DiffUsername::where('username', '=', $username);

            if (!$usernameHistory->exists()) abort(404);

            return redirect()->route('user.profile', $usernameHistory->first()->user->username);
        }

        $user = $user->first();
       //  $spaces = $user->spaces()->take(6);
        $joindate = Carbon::parse($user->created_at)->format('M d Y');
        $user->joindate = str_replace(" ‐", ",", $joindate);
	$user->loadCount(['followers', 'following', 'posts']);
	$following = $user->following()->get();
	$followers = $user->followers()->get();
---
select exists(select * from `users` where `username` = 'anu') as `exists`
select * from `users` where `username` = 'anu' limit 1
select `users`.*, `followers`.`following_id` as `pivot_following_id`, `followers`.`follower_id` as `pivot_follower_id` from `users` inner join `followers` on `users`.`id` = `followers`.`follower_id` where `followers`.`following_id` = 1
select `users`.*, `followers`.`following_id` as `pivot_following_id`, `followers`.`follower_id` as `pivot_follower_id` from `users` inner join `followers` on `users`.`id` = `followers`.`follower_id` where `followers`.`following_id` = 2

    public function ForumIndex($id)
    {
        // Official
        $section_one = ForumTopic::where([['is_staff_only_viewing', false], ['section_id', 1]])->orderBy('id', 'ASC')->get();

        if (Auth::check() && Auth::user()->staff == 1)
            $section_one = ForumTopic::where([['section_id', 1]])->orderBy('id', 'ASC')->get();

        // Community
        $section_two = ForumTopic::where([['is_staff_only_viewing', false], ['section_id', 2]])->orderBy('id', 'ASC')->get();

        if (Auth::check() && Auth::user()->staff == 1)
            $section_two = ForumTopic::where([['section_id', 2], ['hidden', false]])->orderBy('id', 'ASC')->get();

        // Serious
        $section_three = ForumTopic::where([['is_staff_only_viewing', false], ['hidden', false], ['section_id', 3]])->orderBy('id', 'ASC')->get();

        if (Auth::check() && Auth::user()->staff == 1)
            $section_three = ForumTopic::where([['section_id', 3]])->orderBy('id', 'ASC')->get();

        // Posting
        $topic = ForumTopic::where('id', '=', $id)->firstOrFail();
---
select * from `forum_topics` where (`is_staff_only_viewing` = 0 and `section_id` = 1) order by `id` asc
select * from `forum_topics` where (`is_staff_only_viewing` = 0 and `section_id` = 2) order by `id` asc
select * from `forum_topics` where (`is_staff_only_viewing` = 0 and `hidden` = 0 and `section_id` = 3) order by `id` asc
select * from `forum_topics` where `id` = '4' limit 1
select * from `forum_topics` where `id` = '1' limit 1

    public function ForumPost($id, $slug, BBCodeService $bbcodeService)
    {
        // Official
        $section_one = ForumTopic::where([['is_staff_only_viewing', false], ['section_id', 1]])->orderBy('id', 'ASC')->get();

        if (Auth::check() && Auth::user()->staff == 1)
            $section_one = ForumTopic::where([['section_id', 1]])->orderBy('id', 'ASC')->get();

        // Community
        $section_two = ForumTopic::where([['is_staff_only_viewing', false], ['section_id', 2]])->orderBy('id', 'ASC')->get();

        if (Auth::check() && Auth::user()->staff == 1)
            $section_two = ForumTopic::where([['section_id', 2], ['hidden', false]])->orderBy('id', 'ASC')->get();

        // Serious
        $section_three = ForumTopic::where([['is_staff_only_viewing', false], ['hidden', false], ['section_id', 3]])->orderBy('id', 'ASC')->get();

        if (Auth::check() && Auth::user()->staff == 1)
            $section_three = ForumTopic::where([['section_id', 3]])->orderBy('id', 'ASC')->get();

        // Posting
        $postval = ForumThread::where('id', '=', $id)->first();
        $posts = ForumThread::where('id', '=', $id)->firstOrFail();
        $topic = ForumTopic::where('id', '=', $postval->in_topic_id)->first();
---
select * from `forum_topics` where (`is_staff_only_viewing` = 0 and `section_id` = 1) order by `id` asc
select * from `forum_topics` where (`is_staff_only_viewing` = 0 and `section_id` = 2) order by `id` asc
select * from `forum_topics` where (`is_staff_only_viewing` = 0 and `hidden` = 0 and `section_id` = 3) order by `id` asc
select * from `forum_threads` where `id` = '1' limit 1
select * from `forum_topics` where `id` = 1 limit 1

    public function ForumCreate($id)
    {

        $topic = ForumTopic::where('id', '=', $id)->firstOrFail();
---
select * from `forum_topics` where `id` = '4' limit 1