app/Http/Controllers/USController.php

select * from `countries`
---
    public function edit(Request $request): Response
    {
        $countries = Country::all();