app/Models/User.php

    public function avatar()
    {
        return Avatar::where('user_id', '=', $this->id)->first();
---
select * from `user_avatars` where `user_id` = 1 limit 1